Repository: tpay-com/tpay-ios
Catalog: Tpay/Tpay/Resources/Localizables/*.strings
Languages: pl

# field_is_required
source: This field is required
pl: Pole wymagane

# invalid_length
source: Invalid number of characters
pl: Nieprawidłowa liczba znaków

# email_is_invalid
source: Email address is incorrect
pl: Nieprawidłowy adres email

# name_is_invalid
source: Payer name is incorrect
pl: Nieprawidłowa nazwa płatnika

source: Try again
pl: Spróbuj ponownie

# card_number_is_invalid
source: Card number is incorrect
pl: Nieprawidłowy numer karty

# card_expiry_date_is_invalid
source: Expiration date is invalid
pl: Nieprawidłowa data ważności

# card_security_code_is_invalid
source: Security code is invalid
pl: Nieprawidłowy kod

# blik_code_is_invalid
source: BLIK code is incorrect
pl: Nieprawidłowy kod BLIK

source: Cancel
pl: Anuluj

source: Close
pl: Zamknij

source: Back
pl: Wróć

# something_went_wrong
source: Something went wrong. Please, try again.
pl: Coś poszło nie tak! Spróbuj ponownie.

# gdpr_note
source: <span>The personal data administrator is Krajowy Integrator Płatności S.A with its registered office in Poznań. <a href='%@'><b>Show full content.</b></a></span>
pl: <span>Administratorem danych osobowych jest Krajowy Integrator Płatności spółka akcyjna z siedzibą w Poznaniu. <a href='%@'><b>Zapoznaj się z pełną treścią.</b></a></span>

# regulations_note
source: <span>By paying, you accept <a href='%@'><b>regulations</b></a></span>
pl: <span>Płacąc, akceptujesz <a href='%@'><b>regulamin.</b></a></span>

# setup_payer_details_headline
source: Your Details
pl: Twoje dane

# payer_name
source: First and Last Name
pl: Imię i nazwisko

# choose_payment_method
source: Select a payment method
pl: Wybierz metodę płatności

# payment_method_headline
source: Select a payment method
pl: Wybierz formę płatności

# pbl
source: Transfer
pl: Przelew

# card
source: Credit Card
pl: Karta

# digital_wallets
source: Mobile wallets
pl: Portfel elektroniczny

# pay_with_card_headline
source: Add card
pl: Dodaj kartę

source: Card number
pl: Numer karty

# card_expiry_date
source: Expiration date
pl: Data ważności

# card_expiry_date_hint
source: MM/YY
pl: MM/RR

# save_card_note
source: Save this card for future purchases.
pl: Zapisz kartę, aby nie uzupełniać formularza przy następnych zakupach.

# merchant_gdpr_note_without_headquarters
source: <span>The personal data administrator is %@. <a href='%@'><b>Show full content.</b></a></span>
pl: <span>Administratorem danych osobowych jest %@.</br><a href='%@'><b>Zapoznaj się z pełną treścią.</b></a></span>

# merchant_gdpr_note_with_headquarters
source: <span>The personal data administrator is %@ with its registered office in %@. <a href='%@'><b>Show full content.</b></a></span>
pl: <span>Administratorem danych osobowych jest %@ z siedzibą w %@.</br><a href='%@'><b>Zapoznaj się z pełną treścią.</b></a></span>

# im_paying
source: Pay %@
pl: Płacę %@

# navigate_to_card_selection
source: Select a card
pl: Wybór karty

# pay_with_card_token_headline
source: Select a card
pl: Wybierz kartę

source: Add card
pl: Dodaj Kartę

# blik_code
source: Enter BLIK code
pl: Wpisz kod BLIK

# register_blik_alias_note
source: Remember the store and enable one-click payment
pl: Zapamiętaj sklep i włącz płatność one-click

# alias_label_placeholder
source: Name the store
pl: Nazwij sklep

# pay_with_blik_alias_note
source: You do not have to enter the BLIK code - you shop in a previously remembered store.
pl: Nie musisz podawać kodu BLIK - robisz zakupy w zapisanym wcześniej sklepie.

# pay_with_raty_pekao_scene_headline
source: Choose installment option
pl: Wybierz wariant rat

# pay_with_raty_pekao_scene_action_button_title
source: Continue
pl: Przejdź dalej

# processing_payment_title
source: Payment processing
pl: Przetwarzanie płatności

# processing_payment_message
source: Just a moment more. We are waiting for your bank response.
pl: Jeszcze chwila. Czekamy na odpowiedź Twojego banku

# payment_success_title
source: Payment successfully completed
pl: Płatność zakończona sukcesem

# payment_success_button_title
source: My orders
pl: Moje zamówienia

# payment_failure_title
source: Payment failed
pl: Płatność nieudana

# payment_failure_button_title
source: Try again
pl: Ponów płatność

# scanning_description
source: The data is read in real time. Card details are not saved anywhere.
pl: Odczyt danych odbywa się w czasie rzeczywistym. Dane karty nie są nigdzie zapisywane.

# put_card_in_detection_area
source: Put the card in the frame
pl: Umieść kartę w ramce

# scanning_error
source: The data could not be read
pl: Nie udało się odczytać danych

# pay_with_headline
source: Pay with
pl: Zapłać za pomocą

source: Pay with code
pl: Zapłać przy użyciu kodu

# pay_by_link_headline
source: Choose your bank
pl: Wybierz swój bank

# add_card_headline
source: Add card
pl: Dodaj kartę

# add_card_save
source: Save card
pl: Zapisz kartę

# tokenization_success_title
source: Card added successfully!
pl: Karta została dodana!

# tokenization_success_description
source: You can now make payments using your card
pl: Możesz teraz dokonywać płatności za pomocą karty

# tokenization_failure_title
source: Sorry, the card could not be added
pl: Niestety, nie udało się dodać karty

# tokenization_failure_description
source: Please try again or choose a different payment method
pl: Proszę spróbować ponownie lub wybrać inną metodę płatności

# payment_failed_general
source: Payment failed. Please try again or choose a different payment method.
pl: Płatność nie powiodła się. Spróbuj ponownie lub wybierz inną metodę płatności.

# transaction_attempt_error_title
source: Transaction errors:
pl: Błędy transakcji:

# transaction_attempt_error_blik_unknown
source: Unknown BLIK error
pl: Nieznany błąd BLIK

# transaction_attempt_error_blik_declined
source: Payment declined by user
pl: Płatność odrzucona przez użytkownika

# transaction_attempt_error_blik_general
source: General BLIK error
pl: Ogólny błąd BLIK

# transaction_attempt_error_blik_insufficient_funds
source: User insufficient funds
pl: Użytkownik nie posiada wystarczających środków

# transaction_attempt_error_blik_timeout
source: BLIK system timeout
pl: Przekroczono czas oczekiwania

source: No Internet connection
pl: Brak połączenia z internetem
